/*Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви).
  Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

    Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
    Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
    Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0

Променетата матрица да се испечати на екран.*/

#include <iostream>
using namespace std;

int main() {

int x;
    cin>>x;
    int m, n;
    cin>>m>>n;
    int arr[100][100];
    int sum=0;
    for (int i=0; i<m; i++) {
        for (int j=0; j<n; j++) {
            cin>>arr[i][j];
        }
    }
    for (int i=0; i<m; i++) {
        sum=0;
        for (int j=0; j<n; j++) {
            sum+=arr[i][j];
        }
        if (sum>x) {
            for (int k=0; k<n; k++) {
                arr[i][k]=1;
            }
        }else if (sum<x) {
            for (int k=0; k<n; k++) {
                arr[i][k]=-1;
            }
        }else if (sum==x){
            for (int k=0; k<n; k++) {
                arr[i][k]=0;
            }
        }
    }
    for (int i=0; i<m; i++) {
        for (int j=0; j<n; j++) {
            cout<<arr[i][j]<<" ";
        }
        cout<<endl;
    }

    return 0;
}
