/*Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.

Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број. За секој од нив да се испечати максималната цифра во посебен ред.

Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.

Забелешка: ЗАБРАНЕТО е користење на глобални променливи.*/

#include <iostream>
using namespace std;

int rekurzija(int x) {

    if (x<10)
        return x;

    int max = rekurzija(x/10);
    int poslednacifra=x%10;
    return(max>poslednacifra ? max : poslednacifra);


}

int main() {

int x;
    while (cin>>x) {

        cout<<rekurzija(x)<<endl;

    }

}
